### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_network_connectivity_group.prod-core-center will be created
  + resource "google_network_connectivity_group" "prod-core-center" {
      + create_time      = (known after apply)
      + description      = "NCC PROD center group - Managed by Terraform"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + hub              = (known after apply)
      + id               = (known after apply)
      + name             = "center"
      + project          = "chspoc-prod-core"
      + route_table      = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + uid              = (known after apply)
      + update_time      = (known after apply)
    }

  # google_network_connectivity_group.prod-core-edge will be created
  + resource "google_network_connectivity_group" "prod-core-edge" {
      + create_time      = (known after apply)
      + description      = "NCC PROD edge group - Managed by Terraform"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + hub              = (known after apply)
      + id               = (known after apply)
      + name             = "edge"
      + project          = "chspoc-prod-core"
      + route_table      = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + uid              = (known after apply)
      + update_time      = (known after apply)
    }

  # google_network_connectivity_hub.prod-hub will be created
  + resource "google_network_connectivity_hub" "prod-hub" {
      + create_time      = (known after apply)
      + description      = "NCC PROD Hub - Managed by Terraform"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + export_psc       = (known after apply)
      + id               = (known after apply)
      + name             = "ncc-prod-hub"
      + policy_mode      = (known after apply)
      + preset_topology  = "STAR"
      + project          = "chspoc-prod-core"
      + routing_vpcs     = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + unique_id        = (known after apply)
      + update_time      = (known after apply)
    }

  # google_network_connectivity_spoke.transit-prod-spoke will be created
  + resource "google_network_connectivity_spoke" "transit-prod-spoke" {
      + create_time      = (known after apply)
      + description      = "NCC Spoke - Transit PROD - Managed by Terraform"
      + effective_labels = {
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "scope"                      = "ncc-prod"
        }
      + group            = (known after apply)
      + hub              = (known after apply)
      + id               = (known after apply)
      + labels           = {
          + "environment" = "prod"
          + "scope"       = "ncc-prod"
        }
      + location         = "global"
      + name             = "ncc-transit-prod-spoke"
      + project          = "chspoc-prod-core"
      + reasons          = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "scope"                      = "ncc-prod"
        }
      + unique_id        = (known after apply)
      + update_time      = (known after apply)

      + linked_vpc_network {
          + uri = (known after apply)
        }
    }

  # module.dev-net-firewall-policy.google_compute_firewall_policy_rule.hierarchical["ingress/in-inspect-app-svc"] will be updated in-place
  ~ resource "google_compute_firewall_policy_rule" "hierarchical" {
        id                      = "locations/global/firewallPolicies/896163021144/rules/4201"
      ~ security_profile_group  = "//networksecurity.googleapis.com/organizations/872410903863/locations/global/securityProfileGroups/secprof-nsp-threatprevention-1-group" -> "organizations/872410903863/locations/global/securityProfileGroups/secprof-nsp-threatprevention-1-group"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod-core-project.google_project.project[0] will be created
  + resource "google_project" "project" {
      + auto_create_network = false
      + billing_account     = "019AF3-3082AF-842582"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + folder_id           = "514284574833"
      + id                  = (known after apply)
      + name                = "chspoc-prod-core"
      + number              = (known after apply)
      + project_id          = "chspoc-prod-core"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.prod-core-project.google_project_iam_member.service_agents["compute-system"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + role    = "roles/compute.serviceAgent"
    }

  # module.prod-core-project.google_project_iam_member.service_agents["container-engine-robot"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + role    = "roles/container.serviceAgent"
    }

  # module.prod-core-project.google_project_iam_member.service_agents["dns"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + role    = "roles/dns.serviceAgent"
    }

  # module.prod-core-project.google_project_iam_member.service_agents["gkenode"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + role    = "roles/container.defaultNodeServiceAgent"
    }

  # module.prod-core-project.google_project_iam_member.service_agents["monitoring-notification"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + role    = "roles/monitoring.notificationServiceAgent"
    }

  # module.prod-core-project.google_project_iam_member.service_agents["networkmanagement"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + role    = "roles/networkmanagement.serviceAgent"
    }

  # module.prod-core-project.google_project_iam_member.service_agents["service-networking"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + role    = "roles/servicenetworking.serviceAgent"
    }

  # module.prod-core-project.google_project_iam_member.service_agents["vmwareengine"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + role    = "roles/vmwareengine.serviceAgent"
    }

  # module.prod-core-project.google_project_iam_member.service_agents["vpcaccess"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + role    = "roles/vpcaccess.serviceAgent"
    }

  # module.prod-core-project.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "compute.googleapis.com"
    }

  # module.prod-core-project.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "container.googleapis.com"
    }

  # module.prod-core-project.google_project_service.project_services["dns.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "dns.googleapis.com"
    }

  # module.prod-core-project.google_project_service.project_services["iap.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "iap.googleapis.com"
    }

  # module.prod-core-project.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "logging.googleapis.com"
    }

  # module.prod-core-project.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "monitoring.googleapis.com"
    }

  # module.prod-core-project.google_project_service.project_services["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "networkmanagement.googleapis.com"
    }

  # module.prod-core-project.google_project_service.project_services["networksecurity.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "networksecurity.googleapis.com"
    }

  # module.prod-core-project.google_project_service.project_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.prod-core-project.google_project_service.project_services["vmwareengine.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "vmwareengine.googleapis.com"
    }

  # module.prod-core-project.google_project_service.project_services["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-core"
      + service                    = "vpcaccess.googleapis.com"
    }

  # module.prod-core-project.google_project_service_identity.default["container.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + service = "container.googleapis.com"
    }

  # module.prod-core-project.google_project_service_identity.default["dns.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + service = "dns.googleapis.com"
    }

  # module.prod-core-project.google_project_service_identity.default["iap.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + service = "iap.googleapis.com"
    }

  # module.prod-core-project.google_project_service_identity.default["monitoring.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + service = "monitoring.googleapis.com"
    }

  # module.prod-core-project.google_project_service_identity.default["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + service = "networkmanagement.googleapis.com"
    }

  # module.prod-core-project.google_project_service_identity.default["networksecurity.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + service = "networksecurity.googleapis.com"
    }

  # module.prod-core-project.google_project_service_identity.default["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + service = "servicenetworking.googleapis.com"
    }

  # module.prod-core-project.google_project_service_identity.default["vmwareengine.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + service = "vmwareengine.googleapis.com"
    }

  # module.prod-core-project.google_project_service_identity.default["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-core"
      + service = "vpcaccess.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "chspoc-prod-host-app1"
    }

  # module.prod-host-prjs["app1"].google_network_connectivity_spoke.transit-dev-spoke will be created
  + resource "google_network_connectivity_spoke" "transit-dev-spoke" {
      + create_time      = (known after apply)
      + description      = "NCC Spoke - Host Prj - Managed by Terraform"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + group            = "projects/chspoc-prod-core/locations/global/hubs/ncc-prod-hub/groups/edge"
      + hub              = "projects/chspoc-prod-core/locations/global/hubs/ncc-prod-hub"
      + id               = (known after apply)
      + location         = "global"
      + name             = "ncc-chspoc-prod-host-app1-spoke"
      + project          = "chspoc-prod-host-app1"
      + reasons          = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + unique_id        = (known after apply)
      + update_time      = (known after apply)

      + linked_vpc_network {
          + uri = (known after apply)
        }
    }

  # module.prod-host-prjs["app1"].google_project.project[0] will be created
  + resource "google_project" "project" {
      + auto_create_network = false
      + billing_account     = "019AF3-3082AF-842582"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + folder_id           = "514284574833"
      + id                  = (known after apply)
      + name                = "chspoc-prod-host-app1"
      + number              = (known after apply)
      + project_id          = "chspoc-prod-host-app1"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.prod-host-prjs["app1"].google_project_iam_member.service_agents["compute-system"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + role    = "roles/compute.serviceAgent"
    }

  # module.prod-host-prjs["app1"].google_project_iam_member.service_agents["container-engine-robot"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + role    = "roles/container.serviceAgent"
    }

  # module.prod-host-prjs["app1"].google_project_iam_member.service_agents["dns"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + role    = "roles/dns.serviceAgent"
    }

  # module.prod-host-prjs["app1"].google_project_iam_member.service_agents["gkenode"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + role    = "roles/container.defaultNodeServiceAgent"
    }

  # module.prod-host-prjs["app1"].google_project_iam_member.service_agents["monitoring-notification"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + role    = "roles/monitoring.notificationServiceAgent"
    }

  # module.prod-host-prjs["app1"].google_project_iam_member.service_agents["networkmanagement"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + role    = "roles/networkmanagement.serviceAgent"
    }

  # module.prod-host-prjs["app1"].google_project_iam_member.service_agents["service-networking"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + role    = "roles/servicenetworking.serviceAgent"
    }

  # module.prod-host-prjs["app1"].google_project_iam_member.service_agents["vpcaccess"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + role    = "roles/vpcaccess.serviceAgent"
    }

  # module.prod-host-prjs["app1"].google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-app1"
      + service                    = "compute.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-app1"
      + service                    = "container.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service.project_services["dns.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-app1"
      + service                    = "dns.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service.project_services["iap.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-app1"
      + service                    = "iap.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-app1"
      + service                    = "logging.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-app1"
      + service                    = "monitoring.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service.project_services["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-app1"
      + service                    = "networkmanagement.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service.project_services["networksecurity.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-app1"
      + service                    = "networksecurity.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service.project_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-app1"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service.project_services["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-app1"
      + service                    = "vpcaccess.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service_identity.default["container.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + service = "container.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service_identity.default["dns.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + service = "dns.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service_identity.default["iap.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + service = "iap.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service_identity.default["monitoring.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + service = "monitoring.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service_identity.default["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + service = "networkmanagement.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service_identity.default["networksecurity.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + service = "networksecurity.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service_identity.default["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + service = "servicenetworking.googleapis.com"
    }

  # module.prod-host-prjs["app1"].google_project_service_identity.default["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-app1"
      + service = "vpcaccess.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "chspoc-prod-host-svc1"
    }

  # module.prod-host-prjs["svc1"].google_network_connectivity_spoke.transit-dev-spoke will be created
  + resource "google_network_connectivity_spoke" "transit-dev-spoke" {
      + create_time      = (known after apply)
      + description      = "NCC Spoke - Host Prj - Managed by Terraform"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + group            = "projects/chspoc-prod-core/locations/global/hubs/ncc-prod-hub/groups/center"
      + hub              = "projects/chspoc-prod-core/locations/global/hubs/ncc-prod-hub"
      + id               = (known after apply)
      + location         = "global"
      + name             = "ncc-chspoc-prod-host-svc1-spoke"
      + project          = "chspoc-prod-host-svc1"
      + reasons          = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + unique_id        = (known after apply)
      + update_time      = (known after apply)

      + linked_vpc_network {
          + uri = (known after apply)
        }
    }

  # module.prod-host-prjs["svc1"].google_project.project[0] will be created
  + resource "google_project" "project" {
      + auto_create_network = false
      + billing_account     = "019AF3-3082AF-842582"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + folder_id           = "514284574833"
      + id                  = (known after apply)
      + name                = "chspoc-prod-host-svc1"
      + number              = (known after apply)
      + project_id          = "chspoc-prod-host-svc1"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.prod-host-prjs["svc1"].google_project_iam_member.service_agents["compute-system"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + role    = "roles/compute.serviceAgent"
    }

  # module.prod-host-prjs["svc1"].google_project_iam_member.service_agents["container-engine-robot"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + role    = "roles/container.serviceAgent"
    }

  # module.prod-host-prjs["svc1"].google_project_iam_member.service_agents["dns"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + role    = "roles/dns.serviceAgent"
    }

  # module.prod-host-prjs["svc1"].google_project_iam_member.service_agents["gkenode"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + role    = "roles/container.defaultNodeServiceAgent"
    }

  # module.prod-host-prjs["svc1"].google_project_iam_member.service_agents["monitoring-notification"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + role    = "roles/monitoring.notificationServiceAgent"
    }

  # module.prod-host-prjs["svc1"].google_project_iam_member.service_agents["networkmanagement"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + role    = "roles/networkmanagement.serviceAgent"
    }

  # module.prod-host-prjs["svc1"].google_project_iam_member.service_agents["service-networking"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + role    = "roles/servicenetworking.serviceAgent"
    }

  # module.prod-host-prjs["svc1"].google_project_iam_member.service_agents["vpcaccess"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + role    = "roles/vpcaccess.serviceAgent"
    }

  # module.prod-host-prjs["svc1"].google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-svc1"
      + service                    = "compute.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-svc1"
      + service                    = "container.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service.project_services["dns.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-svc1"
      + service                    = "dns.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service.project_services["iap.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-svc1"
      + service                    = "iap.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-svc1"
      + service                    = "logging.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-svc1"
      + service                    = "monitoring.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service.project_services["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-svc1"
      + service                    = "networkmanagement.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service.project_services["networksecurity.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-svc1"
      + service                    = "networksecurity.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service.project_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-svc1"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service.project_services["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "chspoc-prod-host-svc1"
      + service                    = "vpcaccess.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service_identity.default["container.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + service = "container.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service_identity.default["dns.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + service = "dns.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service_identity.default["iap.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + service = "iap.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service_identity.default["monitoring.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + service = "monitoring.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service_identity.default["networkmanagement.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + service = "networkmanagement.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service_identity.default["networksecurity.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + service = "networksecurity.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service_identity.default["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + service = "servicenetworking.googleapis.com"
    }

  # module.prod-host-prjs["svc1"].google_project_service_identity.default["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "chspoc-prod-host-svc1"
      + service = "vpcaccess.googleapis.com"
    }

  # module.prod-net-firewall-policy.google_compute_firewall_policy_rule.hierarchical["ingress/in-allow-dapp1-dsvc1"] will be created
  + resource "google_compute_firewall_policy_rule" "hierarchical" {
      + action             = "allow"
      + creation_timestamp = (known after apply)
      + description        = "Allow all from DevApp1 to DevSvc1"
      + direction          = "INGRESS"
      + disabled           = false
      + firewall_policy    = "2540520614"
      + id                 = (known after apply)
      + kind               = (known after apply)
      + priority           = 3001
      + rule_tuple_count   = (known after apply)

      + match {
          + dest_ip_ranges = [
              + "10.1.11.0/24",
            ]
          + src_ip_ranges  = [
              + "10.1.21.0/24",
            ]

          + layer4_configs {
              + ip_protocol = "tcp"
              + ports       = []
            }
        }
    }

  # module.prod-net-firewall-policy.google_compute_firewall_policy_rule.hierarchical["ingress/in-inspect-app-svc"] will be created
  + resource "google_compute_firewall_policy_rule" "hierarchical" {
      + action                 = "apply_security_profile_group"
      + creation_timestamp     = (known after apply)
      + description            = "Inspect App project - Svc project"
      + direction              = "INGRESS"
      + disabled               = false
      + firewall_policy        = "2540520614"
      + id                     = (known after apply)
      + kind                   = (known after apply)
      + priority               = 4201
      + rule_tuple_count       = (known after apply)
      + security_profile_group = (known after apply)

      + match {
          + dest_ip_ranges = [
              + "10.1.12.0/24",
            ]
          + src_ip_ranges  = [
              + "10.1.22.0/24",
            ]

          + layer4_configs {
              + ip_protocol = "tcp"
              + ports       = []
            }
        }
    }

  # module.prod-transit-vpc.google_compute_network.network[0] will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + description                               = "Terraform-managed."
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "prod-transit-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "chspoc-prod-core"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

  # module.prod-transit-vpc.google_compute_route.gateway["directpath-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "34.126.0.0/18"
      + id                         = (known after apply)
      + name                       = "prod-transit-vpc-directpath-googleapis"
      + network                    = "prod-transit-vpc"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-prod-core"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.prod-transit-vpc.google_compute_route.gateway["private-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.8/30"
      + id                         = (known after apply)
      + name                       = "prod-transit-vpc-private-googleapis"
      + network                    = "prod-transit-vpc"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-prod-core"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.prod-transit-vpc.google_compute_route.gateway["restricted-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.4/30"
      + id                         = (known after apply)
      + name                       = "prod-transit-vpc-restricted-googleapis"
      + network                    = "prod-transit-vpc"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-prod-core"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.prod-transit-vpc.google_compute_subnetwork.subnetwork["us-central1/sn-transit-prod"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + allow_subnet_cidr_routes_overlap = (known after apply)
      + creation_timestamp               = (known after apply)
      + description                      = "Default primary-region subnet for prod"
      + enable_flow_logs                 = (known after apply)
      + external_ipv6_prefix             = (known after apply)
      + fingerprint                      = (known after apply)
      + gateway_address                  = (known after apply)
      + id                               = (known after apply)
      + internal_ipv6_prefix             = (known after apply)
      + ip_cidr_range                    = "10.1.0.0/24"
      + ipv6_cidr_range                  = (known after apply)
      + ipv6_gce_endpoint                = (known after apply)
      + name                             = "sn-transit-prod"
      + network                          = "prod-transit-vpc"
      + private_ip_google_access         = true
      + private_ipv6_google_access       = (known after apply)
      + project                          = "chspoc-prod-core"
      + purpose                          = (known after apply)
      + region                           = "us-central1"
      + self_link                        = (known after apply)
      + send_secondary_ip_range_if_empty = true
      + stack_type                       = (known after apply)
      + state                            = (known after apply)
      + subnetwork_id                    = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # module.prod-host-prjs["app1"].module.vpc.google_compute_network.network[0] will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + description                               = "Terraform-managed."
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "vpc-prod-app1"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "chspoc-prod-host-app1"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

  # module.prod-host-prjs["app1"].module.vpc.google_compute_route.gateway["directpath-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "34.126.0.0/18"
      + id                         = (known after apply)
      + name                       = "vpc-prod-app1-directpath-googleapis"
      + network                    = "vpc-prod-app1"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-prod-host-app1"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.prod-host-prjs["app1"].module.vpc.google_compute_route.gateway["private-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.8/30"
      + id                         = (known after apply)
      + name                       = "vpc-prod-app1-private-googleapis"
      + network                    = "vpc-prod-app1"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-prod-host-app1"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.prod-host-prjs["app1"].module.vpc.google_compute_route.gateway["restricted-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.4/30"
      + id                         = (known after apply)
      + name                       = "vpc-prod-app1-restricted-googleapis"
      + network                    = "vpc-prod-app1"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-prod-host-app1"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.prod-host-prjs["app1"].module.vpc.google_compute_subnetwork.subnetwork["us-central1/sn-prodapp1-usc1-a"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + allow_subnet_cidr_routes_overlap = (known after apply)
      + creation_timestamp               = (known after apply)
      + description                      = "Terraform-managed."
      + enable_flow_logs                 = (known after apply)
      + external_ipv6_prefix             = (known after apply)
      + fingerprint                      = (known after apply)
      + gateway_address                  = (known after apply)
      + id                               = (known after apply)
      + internal_ipv6_prefix             = (known after apply)
      + ip_cidr_range                    = "10.3.21.0/24"
      + ipv6_cidr_range                  = (known after apply)
      + ipv6_gce_endpoint                = (known after apply)
      + name                             = "sn-prodapp1-usc1-a"
      + network                          = "vpc-prod-app1"
      + private_ip_google_access         = true
      + private_ipv6_google_access       = (known after apply)
      + project                          = "chspoc-prod-host-app1"
      + purpose                          = (known after apply)
      + region                           = "us-central1"
      + self_link                        = (known after apply)
      + send_secondary_ip_range_if_empty = true
      + stack_type                       = (known after apply)
      + state                            = (known after apply)
      + subnetwork_id                    = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # module.prod-host-prjs["svc1"].module.ngfw_enterprise[0].google_network_security_firewall_endpoint.fw_endpoint_primary will be created
  + resource "google_network_security_firewall_endpoint" "fw_endpoint_primary" {
      + associated_networks = (known after apply)
      + billing_project_id  = "chspoc-prod-host-svc1"
      + create_time         = (known after apply)
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                  = (known after apply)
      + location            = "us-central1-a"
      + name                = "fwe-chspoc-prod-host-svc1-us-central1-a"
      + parent              = "organizations/872410903863"
      + reconciling         = (known after apply)
      + self_link           = (known after apply)
      + state               = (known after apply)
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time         = (known after apply)

      + timeouts {
          + create = "6h"
          + delete = "6h"
        }
    }

  # module.prod-host-prjs["svc1"].module.ngfw_enterprise[0].google_network_security_firewall_endpoint.fw_endpoint_secondary will be created
  + resource "google_network_security_firewall_endpoint" "fw_endpoint_secondary" {
      + associated_networks = (known after apply)
      + billing_project_id  = "chspoc-prod-host-svc1"
      + create_time         = (known after apply)
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                  = (known after apply)
      + location            = "us-central1-b"
      + name                = "fwe-chspoc-prod-host-svc1-us-central1-b"
      + parent              = "organizations/872410903863"
      + reconciling         = (known after apply)
      + self_link           = (known after apply)
      + state               = (known after apply)
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time         = (known after apply)

      + timeouts {
          + create = "6h"
          + delete = "6h"
        }
    }

  # module.prod-host-prjs["svc1"].module.ngfw_enterprise[0].google_network_security_firewall_endpoint_association.fw_endp_association_primary will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_endp_association_primary" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = (known after apply)
      + id                = (known after apply)
      + location          = "us-central1-a"
      + name              = (known after apply)
      + network           = (known after apply)
      + parent            = "projects/chspoc-prod-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)

      + timeouts {
          + create = "6h"
          + delete = "6h"
        }
    }

  # module.prod-host-prjs["svc1"].module.ngfw_enterprise[0].google_network_security_firewall_endpoint_association.fw_endp_association_secondary will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_endp_association_secondary" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = (known after apply)
      + id                = (known after apply)
      + location          = "us-central1-b"
      + name              = (known after apply)
      + network           = (known after apply)
      + parent            = "projects/chspoc-prod-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)

      + timeouts {
          + create = "6h"
          + delete = "6h"
        }
    }

  # module.prod-host-prjs["svc1"].module.ngfw_enterprise[0].google_network_security_security_profile.fw_sec_prof will be created
  + resource "google_network_security_security_profile" "fw_sec_prof" {
      + create_time      = (known after apply)
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag             = (known after apply)
      + id               = (known after apply)
      + location         = "global"
      + name             = "secprof-nsp-threatprevention-p"
      + parent           = "organizations/872410903863"
      + self_link        = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + type             = "THREAT_PREVENTION"
      + update_time      = (known after apply)
    }

  # module.prod-host-prjs["svc1"].module.ngfw_enterprise[0].google_network_security_security_profile_group.fw_sec_prof_group will be created
  + resource "google_network_security_security_profile_group" "fw_sec_prof_group" {
      + create_time               = (known after apply)
      + effective_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + location                  = "global"
      + name                      = "secprof-nsp-threatprevention-p-group"
      + parent                    = "organizations/872410903863"
      + terraform_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + threat_prevention_profile = (known after apply)
      + update_time               = (known after apply)
    }

  # module.prod-host-prjs["svc1"].module.vpc.google_compute_network.network[0] will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + description                               = "Terraform-managed."
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "vpc-prod-svc1"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "chspoc-prod-host-svc1"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

  # module.prod-host-prjs["svc1"].module.vpc.google_compute_route.gateway["directpath-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "34.126.0.0/18"
      + id                         = (known after apply)
      + name                       = "vpc-prod-svc1-directpath-googleapis"
      + network                    = "vpc-prod-svc1"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-prod-host-svc1"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.prod-host-prjs["svc1"].module.vpc.google_compute_route.gateway["private-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.8/30"
      + id                         = (known after apply)
      + name                       = "vpc-prod-svc1-private-googleapis"
      + network                    = "vpc-prod-svc1"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-prod-host-svc1"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.prod-host-prjs["svc1"].module.vpc.google_compute_route.gateway["restricted-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.4/30"
      + id                         = (known after apply)
      + name                       = "vpc-prod-svc1-restricted-googleapis"
      + network                    = "vpc-prod-svc1"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "chspoc-prod-host-svc1"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.prod-host-prjs["svc1"].module.vpc.google_compute_subnetwork.subnetwork["us-central1/sn-prodsvc1-usc1-a"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + allow_subnet_cidr_routes_overlap = (known after apply)
      + creation_timestamp               = (known after apply)
      + description                      = "Terraform-managed."
      + enable_flow_logs                 = (known after apply)
      + external_ipv6_prefix             = (known after apply)
      + fingerprint                      = (known after apply)
      + gateway_address                  = (known after apply)
      + id                               = (known after apply)
      + internal_ipv6_prefix             = (known after apply)
      + ip_cidr_range                    = "10.1.11.0/24"
      + ipv6_cidr_range                  = (known after apply)
      + ipv6_gce_endpoint                = (known after apply)
      + name                             = "sn-prodsvc1-usc1-a"
      + network                          = "vpc-prod-svc1"
      + private_ip_google_access         = true
      + private_ipv6_google_access       = (known after apply)
      + project                          = "chspoc-prod-host-svc1"
      + purpose                          = (known after apply)
      + region                           = "us-central1"
      + self_link                        = (known after apply)
      + send_secondary_ip_range_if_empty = true
      + stack_type                       = (known after apply)
      + state                            = (known after apply)
      + subnetwork_id                    = (known after apply)

      + secondary_ip_range (known after apply)
    }

Plan: 115 to add, 1 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "root_folder_id" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "tag_names" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `success`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*